# St7GetReinforcementName

Returns the names assigned to the specified concrete reinforcement layout.

long St7GetReinforcementName(long uID, long LayoutID, char* LayoutName,
long MaxStringLen)
Input Parameters
uID
Strand7 model file ID.
LayoutID
Reinforcement layout ID.
MaxStringLen
Maximum number of characters allocated to LayoutName.
Output Parameters
LayoutName
Name of the layout.